TRIGGERS = {'микола', 'оля', 'поля', 'валя', 'хоча', 'ольга', 'коля', 'миколай', 'скажи', 'будь ласка', 'підскажи',
            'включи', 'слава', 'ще', 'зроби', 'розкажи'}

ON_WORDS = ['включи', 'включає', '', '', '']
OFF_WORDS = ['вимкни', 'виключи', 'вимкнули']

data_set = {

    'яка погода на вулиці': 'show_weather зараз подивлюся',
    'яка погода': 'show_weather зараз скажу',
    'що там на вулиці': 'show_weather можеш сам подивитися, но зараз скажу',
    'скільки градусів': 'show_weather боїшся замерзнути?',


    'йди спи': 'offBot солодких снів',
    'до побачення': 'offBot сподіваюсь ще вернешся',
    'солодких снів': 'offBot так рано?',


    'як справи': 'passive було краще доки не запитав',
    'що робиш': 'passive роблю твоє життя кращим',
    'здоров': 'passive здоровіших бачив',
    'україні': 'passive героям слава!',
    'нації': 'passive смерть ворогам',
    'україна': 'passive поняд усе',
    'де рускій воєнний корабель': 'passive пішов нахуй',
    'рускій воєнний корабель': 'passive иди нахуй',


    'включив включає включи пісню': 'get_music добре',
    'скачай скачей пісню': 'download_one_music окей',


    'рекоменд порекомендуй порекомендує фільм': 'recommended_film шукаю',

    'цікавий факт': 'i_fact слухай',

    'за що можна випити': 'give_holydays кажу',
    'яке свято': 'give_holydays добре',


    'покаже карту тривог': 'open_map_alarm ок',
}
