# from aiogram import types, Dispatcher
# from aiogram.types import message
# import sqlite3 as sq
#
# db = sq.connect('user.db')
# curs = db.cursor()
# # curs.execute('ALTER TABLE profile DROP COLUM ')
# user_id = 469156495
#
# curs.execute('SELECT * FROM profile WHERE user_id = ?', [user_id])
# city = curs.fetchall()
# print(city)
# db.commit()
# db.close()


with open('help.txt', 'w', encoding='utf-8') as file:
    text = file.write('*Вас вітає команда розробки віртуального асистент "Миколи"!*\n' \
    'Для того, щоб грамотно користуватися "Колею" вам потрібно прочитати інструкцію нижче⬇️\n' \
    '\n' \
    'Бот передбачає керування асистентом як з клавіатури так і голосовими командами, далі буде описана інструкція щодо користування.\n' \
    '\n' \
    '*Користування ботом за допомогою клавіатури:*\n' \
    '\tЦей спосіб комунікації з ботом підходить тоді, коли Вам не зручно записати голосове повідомлення або просто не хочеться.\n ' \
    '\tНа головному меню розташовані кнопки при натисканні на які відбувається певна дія відповідно до назви кнопки.\n ' \
    '\tПри натисканні на кнопку *"Функції🤖"* Вас перекине на нову панель, на якій будуть показані всі можливі функції та розділи.\n ' \
    '\tДо розділів відносяться: *"Мультимедія📼"*, "*Розваги🎭".*\n' \
    '\t*Також в нижній частині панелі розташовані елементи керування:*\n' \
    '\t\t* "🔣" - перехід в головне меню;\n' \
    '\t\t* "◀️" - повернутися назад;\n' \
    '\n' \
    '*Користування ботом за допомогою голосових команд:*\n' \
    '\tПри використанні цього типу керування Вам відкривається нова функція - *"Перетворення голосового повідомлення в текст"*\n' \
    '\tАлгоритм використання бота за допомогою голосу дуже простий, Вам потрібно сказати _ключове_ слово "Коля", або його похідні ' \
    '("Микола", "Никола"...), саму команду та певне слово або фразу яке має відношення до команди.\n' \
    '\tНижче наведені всі доступні команди та приклади їх використання⬇️\n' \
    '\t\t* "Коля скажи яка погода";\n' \
    '\t\t* "Коля порекомендуй фільм";\n' \
    '\t\t* "Коля покажи курс валют";\n' \
    '\t\t* "Коля розкажи цікавий факт";\n' \
    '\t\t* "Коля яке сьогодні свято/за що сьогодні можна випити";\n' \
    '\tВсі команди не прив`язані строго до певного формулювання, тобто можна сказати: *"Коля порекомендуй мені будь ласка фільм на цей прекрасний вечір"*.\n' \
    '\tІ воно все одно буде коректно працювати' \
    '\tВ кожному разі коли Ви надсилаєте Колі голосове повідомлення, він вам відповідає текстом, який від розпізнав з цього аудіо.' \
    '\n' \
    '\tТакож _ключовими словами_ можуть бути: ...' \
    '\n' \
    '*У разі некоректної роботи просимо вас залишити відгук у відповідному полі.*\n')
    print('finaly')